Documents/ро_Реестры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ро_Реестры</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РаботаРО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПозиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролерСТК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРеестра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаказНаряды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказНаряд</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.роЗаказНаряд</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РучКорректировка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗаказНаряда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>18</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерОборудования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>33</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ро_Оборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ппНомерОборудования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПараметров</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>33</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заключение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ро_Заключения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ро_Оборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ро_Оборудование</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодR3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Диаметр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Давление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучКорДавления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХодШтока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПружины</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Пружины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаГОСТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаТипПрибора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаДатаПрибора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтроительнаяДлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПечФорма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПечатныеФормы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьВДокументах</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДокументовДЛяПечФорм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаименованиеДляКонтрагента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеКА</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>222</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Дефектовка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Деталь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДеталиОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дефект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Дефекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Годен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реставрация</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изготовление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Покупка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипМаркаДетали</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>33</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПечатныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ПечатныеФормы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>хрОбработкаПечати</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>333</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФильтрЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаФильтра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>222</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗнФильтра</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФормыПоКонтрагентам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>хрОбработкаПечати</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаОбработки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>333</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лог</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ро_Реестры/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ЗаполнитьНаСервере(ДТ,КА,Обр,ЗкНаряд=Неопределено)
	
	Запрос = новый Запрос;
	Запрос.Текст = "
	               |ВЫБРАТЬ
	               |	РаботаРООстатки.ЗаказНаряд КАК ЗаказНаряд,
	               |	РаботаРООстатки.Оборудование КАК Оборудование,
	               |	РаботаРООстатки.ппНомерОборудования КАК ппНомерОборудования
				   |INTO ВрТблОст
	               |ИЗ
	               |	РегистрНакопления.РаботаРО.Остатки(&Дт
	               |			,
	               |			(ЗаказНаряд.Оборудование В ИЕРАРХИИ (&Обр)
	               |				ИЛИ &Обр = НЕОПРЕДЕЛЕНО)
	               |				И ЗаказНаряд.Контрагент = &КА 
				   |                и (ЗаказНаряд = &ЗкНаряд или &ЗкНаряд = Неопределено)
				   |              ) КАК РаботаРООстатки
				   |
				   |
	               |ГДЕ
	               |	РаботаРООстатки.КолОстаток > 0
				   |
	               |;
	               |SELECT
	               |  Док.ссылка ЗаказНаряд,
	               |  Док.Номер НомерЗаказНаряда,
	               |  Док.НомерОборудования НомерОборудования,
	               |  Док.Заключение Заключение,
				   |  РаботаРООстатки.ппНомерОборудования,
	               |  ДОк.Оборудование,
	               |  CASE WHEN СпрЗак.ссылка IS NULL THEN 1 ELSE 0 END индОплаты
	               |INTO врТбл
	               |
	               |FROM врТблОст РаботаРООстатки
				   |INNER JOIN Документ.роЗаказНаряд Док ON Док.ссылка = РаботаРООстатки.ЗаказНаряд
	               |                                      и РаботаРООстатки.ппНомерОборудования = 0 
	               |
	               |LEFT OUTER JOIN Справочник.ро_Заключения СпрЗак ON СпрЗак.ссылка = Док.Заключение и СпрЗак.БезОплаты = Истина
	               |
	               |UNION ALL
	               |
	               |SELECT
	               |  Док.ссылка ЗаказНаряд,
	               |  Док.НомерАктаДопОбр НомерЗаказНаряда,
	               |  Док.НомерДопОбр НомерОборудования,
	               |  Док.Заключение Заключение,
				   |  РаботаРООстатки.ппНомерОборудования,
	               |  Спр.Ссылка Оборудование,
	               |  CASE WHEN СпрЗак.ссылка IS NULL THEN 1 ELSE 0 END индОплаты
	               |
	               |FROM врТблОст РаботаРООстатки
				   |INNER JOIN Документ.роЗаказНаряд Док ON Док.ссылка = РаботаРООстатки.ЗаказНаряд
	               |                                      и РаботаРООстатки.ппНомерОборудования = 1 
	               |INNER JOIN Справочник.ро_Оборудование Спр ON Спр.ссылка = Док.ТипДопОбр
	               |LEFT OUTER JOIN Справочник.ро_Заключения СпрЗак ON СпрЗак.ссылка = Док.Заключение и СпрЗак.БезОплаты = Истина
	               |
	               |UNION ALL
	               |
	               |SELECT
	               |  Док.ссылка,
	               |  Док.НомерАктаДопОбр1 НомерЗаказНаряда,
	               |  Док.НомерДопОбр1 НомерОборудования,
	               |  Док.Заключение Заключение,
				   |  РаботаРООстатки.ппНомерОборудования,
	               |  Спр.Ссылка Оборудование,
	               |  CASE WHEN СпрЗак.ссылка IS NULL THEN 1 ELSE 0 END индОплаты
	               |
	               |FROM врТблОст РаботаРООстатки
				   |INNER JOIN Документ.роЗаказНаряд Док ON Док.ссылка = РаботаРООстатки.ЗаказНаряд
	               |                                      и РаботаРООстатки.ппНомерОборудования = 2 
	               |INNER JOIN Справочник.ро_Оборудование Спр ON Спр.ссылка = Док.ТипДопОбр1
	               |LEFT OUTER JOIN Справочник.ро_Заключения СпрЗак ON СпрЗак.ссылка = Док.Заключение и СпрЗак.БезОплаты = Истина
	               |
	               |;
	               |SELECT
				   |    РаботаРООстатки.ппНомерОборудования,
	               |	РаботаРООстатки.ЗаказНаряд КАК ЗаказНаряд,
	               |	РаботаРООстатки.Оборудование КАК Оборудование,
	               |	РаботаРООстатки.НомерЗаказНаряда КАК НомерЗаказНаряда,
	               |	РаботаРООстатки.НомерОборудования КАК НомерОборудования,
	               |	РаботаРООстатки.Заключение КАК Заключение,
				   |    MAX(ISNULL(Рег.Цена,ISNULL(Рег0.цена,0))) Цена,
				   |    MAX(ISNULL(Рег.ОписаниеПараметров,Рег0.ОписаниеПараметров)) ОписаниеПараметров
	               |ИЗ
	               |	врТбл КАК РаботаРООстатки
				   |INNER JOIN Справочник.ро_Оборудование Спр ON   Спр.ссылка = РаботаРООстатки.Оборудование
				   |
				   |LEFT OUTER JOIN РегистрСведений.Прайс.СрезПоследних(&Дт) Рег ON Рег.Контрагент = &КА
				   |                                           и Рег.Оборудование  = Спр.родитель 
				   |                                           и (Рег.ДиаметрОт   <= Спр.Диаметр  или Рег.ДиаметрОт = 0)
				   |                                           и (Рег.ДиаметрДо   >= Спр.Диаметр  или Рег.ДиаметрДо = 0)
				   |                                           и (Рег.ДавлениеОт  <= Спр.Давление или Рег.ДавлениеОт = 0)
				   |                                           и (Рег.ДавлениеДо  >= Спр.Давление или Рег.ДавлениеДо = 0)
				   |                                           и  РаботаРООстатки.индОплаты = 1
				   |
				   |LEFT OUTER JOIN РегистрСведений.Прайс.СрезПоследних(&Дт) Рег0 ON Рег0.Контрагент = Значение(Справочник.Контрагенты.ПустаяСсылка)
				   |                                           и Рег0.Оборудование  = Спр.родитель 
				   |                                           и (Рег0.ДиаметрОт   <= Спр.Диаметр  или Рег0.ДиаметрОт = 0)
				   |                                           и (Рег0.ДиаметрДо   >= Спр.Диаметр  или Рег0.ДиаметрДо = 0)
				   |                                           и (Рег0.ДавлениеОт  <= Спр.Давление или Рег0.ДавлениеОт = 0)
				   |                                           и (Рег0.ДавлениеДо  >= Спр.Давление или Рег0.ДавлениеДо = 0)
				   |                                           и  РаботаРООстатки.индОплаты = 1
				   |
				   |GROUP BY
				   |    РаботаРООстатки.ппНомерОборудования,
	               |	РаботаРООстатки.ЗаказНаряд ,
	               |	РаботаРООстатки.Оборудование  ,
	               |	РаботаРООстатки.НомерЗаказНаряда  ,
	               |	РаботаРООстатки.НомерОборудования,  
	               |	РаботаРООстатки.Заключение  
				   |
				   |ORDER BY РаботаРООстатки.Оборудование.родитель.Наименование  ,ЗаказНаряд, ппНомерОборудования 
				   |";
	
	Запрос.УстановитьПараметр("Дт",Дт);
	Запрос.УстановитьПараметр("КА",КА);
	Запрос.УстановитьПараметр("ЗкНаряд",ЗкНаряд);
	Если ЗначениеЗаполнено(Обр) Тогда
		Запрос.УстановитьПараметр("Обр",Обр);
	Иначе
		Запрос.УстановитьПараметр("Обр",Неопределено);
	КонецЕСли;
	
	Тбл = Запрос.Выполнить().Выгрузить();
	сткСтр = "";
	Для каждого Кол из ТБл.Колонки Цикл
		СткСтр = СткСтр+","+Кол.Имя;
	КонецЦикла;
	СткСтр = Сред(СткСтр,2);
	
	Рез = Новый Массив;
	Для каждого Стр из Тбл Цикл
		Стк = Новый Структура(СткСтр);
		ЗаполнитьЗначенияСвойств(Стк,Стр);
		Рез.Добавить(Стк);
	КонецЦикла;
	
	Возврат Рез;

КонецФункции

&НаСервереБезКонтекста
Функция ОбновитьДанныеПоОборудованию(Мас)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ро_Оборудование.Ссылка КАК СсылкаОбр,
	               |	ро_Оборудование.Родитель КАК ГруппаРодитель,
	               |	ро_Оборудование.Диаметр КАК Диаметр,
	               |	ро_Оборудование.Давление КАК Давление
	               |ИЗ  Справочник.ро_Оборудование КАК ро_Оборудование  				  
				   |
	               |ГДЕ
	               |	ро_Оборудование.Ссылка в (&Ссылка) ";
	Запрос.УстановитьПараметр("Ссылка",Мас);
	
	Тбл = Запрос.Выполнить().Выгрузить();
	сткСтр = "";
	Для каждого Кол из ТБл.Колонки Цикл
		СткСтр = СткСтр+","+Кол.Имя;
	КонецЦикла;
	СткСтр = Сред(СткСтр,2);
	
	Рез = Новый Соответствие;
	Для каждого Стр из Тбл Цикл
		Стк = Новый Структура(СткСтр);
		ЗаполнитьЗначенияСвойств(Стк,Стр);
		Рез.Вставить(Стр.СсылкаОбр,Стк);
	КонецЦикла;
	
	Возврат Рез;
	
	
КонецФункции

&НаКлиенте
Процедура ОбновитьРеквизитыОборудования(МасСтр = Неопределено)
	
	Если МасСтр = Неопределено Тогда
		МасСтр = Объект.ЗаказНаряды;	
	КонецесЛИ;
	
	МАс = Новый Массив;
	Для каждого Стр из МасСтр Цикл
		Мас.Добавить(Стр.Оборудование);
	КонецЦикла;
	
	СооОбр = ОбновитьДанныеПоОборудованию(Мас);
	Для каждого Стр из МасСтр Цикл
		Стк = СооОбр.Получить(Стр.Оборудование);
		ЕСли Стк=Неопределено ТОгда Продолжить; КонецЕСлИ;
		ЗаполнитьЗначенияСвойств(Стр,Стк);
	Конеццикла;
	
КонецПроцедуры


&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Проведен ТОгда
		ПоказатьПредупреждение(,"Нельзя заполнять проведенный документ");
		Возврат;
	КонецеСЛИ;
	
	
	Рез = ЗаполнитьНаСервере(Объект.Дата,Объект.Контрагент,Объект.ГруппаОборудования);
	
	СооРуч = новый Соответствие;
	Для каждого Стр из ОБъект.ЗаказНаряды Цикл
		Если Стр.РучКорректировка = Истина Тогда
			СооРуч.Вставить(Стр.ЗаказНаряд,Стр.цена);
		КонецЕсли;
	КонецЦикла;
	
	Если  Команда.Имя = "Заполнить" Тогда
		Объект.ЗаказНаряды.Очистить();
		Для каждого Эл из Рез Цикл
			НовСтр = Объект.ЗаказНаряды.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,Эл);
		КонецЦикла;
	Иначе  //Обновить
		Для каждого Стр из ОБъект.ЗаказНаряды Цикл
			Стр.Цена = 0;
		КонецЦикла;
		
		Стк = Новый Структура("ЗаказНаряд,ппНомерОборудования");
		Для каждого Эл из Рез Цикл
			ЗаполнитьЗначенияСвойств(Стк,эл);
			Мас = Объект.ЗаказНаряды.НайтиСтроки(Стк);
			Для каждого НовСтр из Мас Цикл
				ЗаполнитьЗначенияСвойств(НовСтр,Эл);
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	Для каждого Эл из СооРуч Цикл
		Мас = Объект.ЗаказНаряды.НайтиСтроки(Новый Структура("ЗаказНаряд",Эл.Ключ));
		Если МАс=Неопределено ТОгда Продолжить; КонецЕсли;
		Мас[0].Цена = Эл.Значение;
		Мас[0].РучКорректировка = Истина;
	КонецЦикла;
	
	ОбновитьРеквизитыОборудования();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьПоСумРеестра()
	
	Если Объект.СуммаРеестра=0 ТОгда Возврат; КонецЕСли;
	Если Объект.ЗаказНаряды.Количество()=0 Тогда Возврат; КонецЕсли;
	
	Сум=0;
	Кол=0;
	Кол0=0;
	Для каждого Стр из Объект.ЗаказНаряды Цикл
		Если Стр.Цена=0 ТОгда 
			Кол0 = Кол0 + 1;
		ИНаче
			Сум = Сум + Стр.Цена;
			Кол = Кол + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если Кол=0 ТОгда
		срЦена = 1;
	ИНАче
		срЦена = Сум/Кол;
	КонецЕсли;
	
	итСум = Сум + кол0*срЦена;
	рееСум = 0;
	послСтр = Неопределено;
	
	Для каждого Стр из Объект.ЗаказНаряды Цикл
		Если Стр.цена = 0 Тогда
			пЦен = срЦена;
		Иначе
			пЦен = Стр.Цена;
		КонецЕсли;
		Стр.Цена = ОКР(пЦен/итСум * Объект.СуммаРеестра,2,1);
		рееСум = рееСум + Стр.Цена;
		послСтр = Стр;
	КонецЦикла;
	
	послСтр.Цена = послСтр.Цена+Объект.СуммаРеестра-рееСум;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.лог = ""+ТекущаяДата()+"-"+ИмяПользователя()+"-"+ИмяКомпьютера();
КонецПроцедуры


&НаКлиенте
Процедура ЗаказНарядыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ЗаказНаряд)=Ложь Тогда Возврат; КонецЕсли;
	Если    Поле.Имя = "ЗаказНарядыЗаказНаряд"
		или Поле.Имя = "ЗаказНарядыЦена" Тогда
		Возврат;
	ИначеЕсли Поле.Имя = "ЗаказНарядыЗаказНарядОборудованиеРодитель" Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.ГруппаРодитель);
	Иначе
		ПоказатьЗначение(,Элемент.ТекущиеДанные.ЗаказНаряд);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПечатныеФормыНаСервере(ссДОк,Имя)
	
	Если ЗначениеЗаполнено(ссДОк)=Ложь Тогда Возврат Неопределено; КонецЕсли; 
	
	Если Имя = "Реестр" Тогда
		имя = Имя+" "+ссДок.Номер;
		Возврат Документы.ро_Реестры.ПечатьРеестр(ссДОк);
	ИНАче
		Возврат Справочники.ПечатныеФормы.ПечатьПоКодуФормы(ссДок,Имя);
	КонецЕСЛИ;
	
КонецФункции

&НаКлиенте
Процедура Печать(Команда) Экспорт
	Если ОбщийКлиент.ПроверкаМодифицированности(ЭтаФорма,команда)=Ложь Тогда Возврат; КонецЕсли;
	
	ИмяКодМакета = СокрЛП(Команда.Имя);
	Таб = ПечатныеФормыНаСервере(Объект.Ссылка,ИмяКодМакета);
	Если Таб = Неопределено Тогда Возврат; КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",Новый Структура("Результат,Заголовок",Таб,ИмяКодМакета),,Новый УникальныйИдентификатор());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПечатныеФормыСводНаСервере(сс)
	Возврат Документы.ро_Реестры.ПечатьРеестрСвод(сс);
КонецФункции


&НаКлиенте
Процедура ПЕчатьСвод(Команда)
	Если ОбщийКлиент.ПроверкаМодифицированности(ЭтаФорма,команда)=Ложь Тогда Возврат; КонецЕсли;
	
	ИмяКодМакета = СокрЛП(Команда.Имя);
	Таб = ПечатныеФормыСводНаСервере(Объект.Ссылка);
	Если Таб = Неопределено Тогда Возврат; КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",Новый Структура("Результат,Заголовок",Таб,ИмяКодМакета),,Новый УникальныйИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНарядыЗаказНарядПриИзменении(Элемент)
	ТекСтр = Элементы.ЗаказНаряды.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтр.ЗаказНаряд)=Ложь  Тогда Возврат; КонецЕсли;
	масСтр = Новый Массив;
	
	Мас = ЗаполнитьНаСервере(Объект.Дата,ОБъект.Контрагент,Неопределено,ТекСтр.ЗаказНаряд);
	Для а=1 по Мас.Количество() Цикл
		
		пСтр = Мас[а-1];
		
		Если а>1 Тогда
			пМас = Объект.ЗаказНаряды.НайтиСтроки(Новый Структура("ЗаказНаряд,ппНомерОборудования",пСтр.ЗаказНаряд,пСтр.ппНомерОборудования));
			индекс = Объект.ЗаказНаряды.Индекс(текстр);
			Если пМас.Количество()<>0 Тогда
				текСтр = пМас[0];
				индНов = Объект.ЗаказНаряды.Индекс(текстр);
				Объект.ЗаказНаряды.Сдвинуть(индНов,Индекс-индНов);
			ИНАче
				текСтр = Объект.ЗаказНаряды.Вставить(индекс+1);
			КонецеСЛИ;
		КонецЕСлИ;
		
		ЗаполнитьЗначенияСвойств(ТекСтр,пСтр);
		
		масСтр.Добавить(ТекСтр);
	КонецЦикла;
	
	ОбновитьРеквизитыОборудования(масСтр);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьРеквизитыОборудования();
	ОбновитьРегБух();
	
	РучнаяКорСуммы = Объект.СуммаРеестра<>0;
	РучнаяКорСуммыПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРегБух()
	 Стк = ОбновитьРегБухНаСервере(Объект.ссылка);
	 БухРеализация = Стк.Наименование;
	 Элементы.ФормаПечатьСФ.Видимость = СокрлП(БухРеализация)<>"";
		
КонецПроцедуры
 
 
&НаСервереБезКонтекста
Функция ОбновитьРегБухНаСервере(сс)
	
	Стк = Новый Структура("Наименование");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СоответсвиеИдБухгалтерии.Наименование КАК Наименование,
	               |	СоответсвиеИдБухгалтерии.ДопНаименование КАК ДопНаименование
	               |ИЗ
	               |	РегистрСведений.СоответсвиеИдБухгалтерии КАК СоответсвиеИдБухгалтерии
	               |ГДЕ
	               |	СоответсвиеИдБухгалтерии.Док = &Док";
	Запрос.УстановитьПараметр("Док",сс);
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Стк,Выб);
	КонецЕсли;
	
	Возврат Стк;
	
	
КонецФункции


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьРеквизитыОборудования();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВБухгалтерию(Команда)
	ВыгрузитьВБухгалтериюНаСервере(Объект.Ссылка);
	ОбновитьРегБух();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыгрузитьВБухгалтериюНаСервере(ссДок)
	
	Стк = Новый Структура();
	
	
	Стк.Вставить("GUID",ссДок.УникальныйИдентификатор());
	Стк.Вставить("Дата",ссДок.Дата);
	Стк.Вставить("ВидДок","РеализацияТоваровУслуг");
	Стк.Вставить("КратностьВзаиморасчетов",1);
	Стк.Вставить("КурсВзаиморасчетов",1);
	Стк.Вставить("КодВидаОперации","01");
	Стк.Вставить("СуммаВключаетНДС",Ложь);
	Стк.Вставить("ИННКонтрагентаДляПоиска",ссДок.Контрагент.ИНН);
	Если СокрЛП(ссДок.Контрагент.ДоговорБухКод)<>"" Тогда
		Стк.Вставить("НомерДоговораДляПоиска",ссДок.Контрагент.ДоговорБухКод);
	КонецЕсли;
	Если СокрЛП(ссДок.Контрагент.СубконтоБухКод)<>"" Тогда
		Стк.Вставить("КодСубконто",ссДок.Контрагент.СубконтоБухКод);
	КонецЕсли;
	
	Стк.Вставить("Таблица_Услуги",АлгаРеаПокупателюТаб(ссДок));
	
	СткСоединение = глСервер.СткПолучитьСоединение();
	
	Соединение = Новый HTTPСоединение(
	СткСоединение.Сервер, // сервер (хост)
	СткСоединение.Порт, // порт, по умолчанию для http используется 80, для https 443
	СткСоединение.Логин, // пользователь для доступа к серверу (если он есть)
	СткСоединение.Пароль, // пароль для доступа к серверу (если он есть)
	, // здесь указывается прокси, если он есть
	, // таймаут в секундах, 0 или пусто - не устанавливать
	// защищенное соединение, если используется https
	);
	адресБух = "buh1";
	стрАПИ = адресБух+"/hs/invAPI/LOADDOC";
	Запрос = Новый HTTPЗапрос(стрАПИ);    
	
	хр = Новый ХранилищеЗначения(Стк);
	Запрос.УстановитьТелоИзСтроки(XMLстрока(хр));
	
	Результат = Соединение.POST(Запрос);	
	
	Если Результат.КодСостояния <> 200 Тогда 
		Сообщить("Ошибка синхронизации: код "+Результат.КодСостояния);
		Сообщить(результат.ПолучитьТелоКакСтроку());
		Возврат Неопределено;
	КонецЕСЛИ;
	
	рез = XMLзначение(Тип("ХранилищеЗначения"),Результат.ПолучитьТелоКакСтроку()).Получить();
	
	Если ТипЗнч(Рез) = Тип("Структура") Тогда
		Зап = РегистрыСведений.СоответсвиеИдБухгалтерии.СоздатьМенеджерЗаписи();
		Зап.Док = ссДок;
		Зап.Наименование = Рез.Док;
		Зап.ДопНаименование = "Сч.ф. "+Рез.сфном+" от "+Рез.СФдт;
		Зап.Записать();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция АлгаРеаПокупателюТаб(ссДок) 
	
	ТБл = Новый ТаблицаЗначений;
	ТБл.Колонки.Добавить("Содержание");
	ТБл.Колонки.Добавить("Сумма");
	ТБл.Колонки.Добавить("СуммаНДС");
	ТБл.Колонки.Добавить("СчетКодДоходов");
	ТБл.Колонки.Добавить("СчетКодРасходов");
	ТБл.Колонки.Добавить("СчетКодУчетаНДСПоРеализации");
	ТБл.Колонки.Добавить("НДС20");
	
	
	новСтр = Тбл.Добавить();
	новстр.Содержание = "Оказание услуг по входному контролю и опрессовке запорной и фонтанной арматуры";
	новстр.Сумма = ссДок.СуммаДокумента;
	новстр.СуммаНДС = ОКР(ссДок.СуммаДокумента/5,2,1);
	новСтр.СчетКодДоходов = "90.01.1";
	новСтр.СчетКодРасходов = "90.02.1";
	новСтр.СчетКодУчетаНДСПоРеализации = "90.03";
	
	
	Возврат Тбл;
	
КонецФункции


&НаСервереБезКонтекста
Функция ПечатьСФНаСервере(ссДок)
	
	Стк = Новый Структура();
	Стк.Вставить("ГУИД",ссДок.УникальныйИдентификатор());
	
	СткСоединение = глСервер.СткПолучитьСоединение();
	
	Соединение = Новый HTTPСоединение(
	СткСоединение.Сервер, // сервер (хост)
	СткСоединение.Порт, // порт, по умолчанию для http используется 80, для https 443
	СткСоединение.Логин, // пользователь для доступа к серверу (если он есть)
	СткСоединение.Пароль, // пароль для доступа к серверу (если он есть)
	, // здесь указывается прокси, если он есть
	, // таймаут в секундах, 0 или пусто - не устанавливать
	// защищенное соединение, если используется https
	);
	адресБух = "buh1";
	стрАПИ = адресБух+"/hs/invAPI/PRNDOC";
	Запрос = Новый HTTPЗапрос(стрАПИ);    
	
	хр = Новый ХранилищеЗначения(Стк);
	Запрос.УстановитьТелоИзСтроки(XMLстрока(хр));
	
	Результат = Соединение.POST(Запрос);	
	
	Если Результат.КодСостояния <> 200 Тогда 
		Сообщить("Ошибка синхронизации: код "+Результат.КодСостояния);
		Сообщить(результат.ПолучитьТелоКакСтроку());
		Возврат Неопределено;
	КонецЕСЛИ;
	
	резХР = XMLзначение(Тип("ХранилищеЗначения"),Результат.ПолучитьТелоКакСтроку());
	Если резХР=Неопределено ТОгда Возврат РезХР; КонецЕсли;
	
	Возврат РезХР.Получить();
	
КонецФункции


&НаКлиенте
Процедура ПечатьСФ(Команда)
	
	Если СокрЛП(БухРеализация) ="" ТОгда Возврат; КонецеСЛИ;
	
	Мас = ПечатьСФНаСервере(Объект.Ссылка);
	
	Если ТипЗнч(Мас) = Тип("Массив") Тогда
		Для каждого Таб из Мас Цикл
			ОткрытьФорму("ОбщаяФорма.ФормаПечати",Новый Структура("Результат,Заголовок",Таб,"Печать из бух."),,Новый УникальныйИдентификатор());
		КонецЦикла;
		//Таб.ПОказать();
	ИНаче
		Сообщить("Не найдена счет-фактура в подистеме бухгалтерия!");
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Справочники.ПечатныеФормы.ДобавитьКнопкиПечати(ЭтаФорма,Объект.Контрагент,,2);
КонецПроцедуры

&НаСервереБезКонтекста
Функция Контрагент_Реквизиты(сс)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.ПунктПогрузки КАК ПунктПогрузки,
	               |	Контрагенты.Подписант КАК Подписант,
	               |	Контрагенты.ПодписантДолжность КАК ПодписантДолжность
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Сс);
	Тбл = Запрос.Выполнить().Выгрузить();
	
	Стк = Новый Структура;
	Для каждого Кол из ТБл.Колонки Цикл
		Стк.вставить(Кол.имя,ТБл[0][Кол.имя]);
	Конеццикла;
	
	
	//Последний док
	Запрос.Текст = "ВЫБРАТЬ TOP 1
	               |	ро_Реестры.Организация КАК Организация
	               |ИЗ
	               |	Документ.ро_Реестры КАК ро_Реестры
	               |ГДЕ
	               |	ро_Реестры.Контрагент = &Ссылка
	               |	И ро_Реестры.Проведен = TRUE
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ро_Реестры.Дата УБЫВ";
	
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() ТОгда
		Стк.Вставить("Организация",Выб.Организация);
	КонецЕсли;
	
	
	
	Возврат Стк;
	
КонецФункции


&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
	Стк = Контрагент_Реквизиты(Объект.Контрагент);
	ЗаполнитьЗначенияСвойств(Объект,Стк);
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура РучнаяКорСуммыПриИзменении(Элемент=Неопределено)
	
	Если  Элемент<>Неопределено Тогда
		Если РучнаяКорСуммы=Ложь  Тогда
			Объект.СуммаРеестра=0;
			СуммаРестраПриИзменении(Элемент);
		КонецеСЛИ;
	КонецЕсли;
	
	Элементы.СуммаРеестра.Видимость = РучнаяКорСуммы;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаРестраПриИзменении(Элемент)
	Если Объект.СуммаРеестра<>0 Тогда
		ПересчитатьПоСумРеестра();
	Иначе
		Заполнить(Новый Структура("Имя","Обновить"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНарядыЦенаПриИзменении(Элемент)
	Элементы.ЗаказНаряды.ТекущиеДанные.РучКорректировка = Истина;
КонецПроцедуры
